In [1]:
import MySQLdb as mys
import pandas as pd

print "Connecting to database..."
db = mys.connect(host='localhost', user='root', db="praneetha_example")

df = pd.read_sql('SELECT * FROM zikachart', db)

df.head()

Connecting to database...

,report_date,location,location_type,data_field,data_field_code,time_period,time_period_type,value,unit
0,2016-03-19,Argentina-Buenos_Aires,province,cumulative_confirmed_local_cases,AR0001,NA,NA,0,cases
1,2016-03-19,Argentina-Buenos_Aires,province,cumulative_probable_local_cases,AR0002,NA,NA,0,cases
2,2016-03-19,Argentina-Buenos_Aires,province,cumulative_confirmed_imported_cases,AR0003,NA,NA,2,cases
3,2016-03-19,Argentina-Buenos_Aires,province,cumulative_probable_imported_cases,AR0004,NA,NA,1,cases
4,2016-03-19,Argentina-Buenos_Aires,province,cumulative_cases_under_study,AR0005,NA,NA,127,cases

In [2]:
max_date = """SELECT report_date, location, data_field_code, value FROM zikachart 
WHERE (report_date, location) IN (SELECT MAX(report_date), location FROM zikachart GROUP BY location)"""

df2 = pd.read_sql(max_date, db)

df2.head()

  report_date                location data_field_code  value
0  2016-06-26  Argentina-Buenos_Aires          AR0001      0
1  2016-06-26  Argentina-Buenos_Aires          AR0002      0
2  2016-06-26  Argentina-Buenos_Aires          AR0003      2
3  2016-06-26  Argentina-Buenos_Aires          AR0004      2
4  2016-06-26  Argentina-Buenos_Aires          AR0005    223

[5 rows x 4 columns]

In [3]:
confirmed_codes = open('ConfirmedZikaCodes.txt', 'r')
country_values = {'Argentina': 0, 'Colombia': 0, 'Dominican_Republic': 0, 'Ecuador': 0, \
                  'El_Salvador': 0, 'Guatemala': 0, 'Mexico': 0, 'Nicaragua': 0, 'Panama': 0, \
                  'Puerto_Rico': 0, 'USVI': 0, 'United_States': 0}

conf_df = """(SELECT report_date, location, data_field_code, value FROM (""" + max_date + """) 
AS max_date WHERE 1=0)"""

for line in confirmed_codes:
    country, other = line.split('=')
    if ':' in other:
        codes = other.split(':')[0].split(',')
        for c in codes:
            conf_df = conf_df + """ UNION (SELECT report_date, location, data_field_code, value 
            FROM (""" + max_date + """) AS max_date WHERE data_field_code = '""" + c.strip() + """' 
            GROUP BY location)"""
    else:
        if ',' in other: codes = other.split(',') 
        else: codes = [other]
        for c in codes:
            conf_df = conf_df + """ UNION (SELECT report_date, location, data_field_code, value 
            FROM (""" + max_date + """) AS max_date WHERE data_field_code = '""" + c.strip() + """' 
            AND location = '""" + country + """')"""
            
print "Reading SQL statement..."
conf_pd = pd.read_sql(conf_df, db)

conf_pd.loc[conf_pd['location'] == 'Argentina-Buenos_Aires'].head()

Reading SQL statement...

   report_date                location data_field_code  value
0   2016-06-26  Argentina-Buenos_Aires          AR0001      0
24  2016-06-26  Argentina-Buenos_Aires          AR0003      2

[2 rows x 4 columns]